app/controllers/campaigns_controller.rb

  def index
    @campaigns = @current_user.campaigns.all
---
SELECT "campaigns".* FROM "campaigns"

  def create
    @campaign = Campaign.new(campaign_params)
    @campaign.user = @current_user

    if @campaign.save
---
INSERT INTO "campaigns" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Campaign 2"], ["user_id", 4], ["created_at", "2020-06-11 18:30:03.435007"], ["updated_at", "2020-06-11 18:30:03.435007"]]

  def update
    if @campaign.update(campaign_params)
---
UPDATE "campaigns" SET "name" = $1, "updated_at" = $2 WHERE "campaigns"."id" = $3  [["name", "Ty's Great Campaign"], ["updated_at", "2020-06-12 17:57:20.512724"], ["id", 6]]

  def destroy
    @campaign.destroy
---
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 4]]

    def set_campaign
      @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]