app/controllers/characters_controller.rb

INSERT INTO "characters" ("name", "user_id", "campaign_id", "race", "char_class", "level", "alignment", "xp", "str", "dex", "con", "int", "wis", "cha", "prof_bonus", "hp", "ac", "hit_dice", "inventory", "feats", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    @character = Character.new(character_params)

    if @character.save

DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 5]]
---
  def destroy
    @character.destroy

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_character
      @character = Character.find(params[:id])