app/controllers/characters_controller.rb

    def set_campaign
      @campaign = Campaign.find(params[:campaign_id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]